# クラス：設計図
# オブジェクト：オブジェクトをもとに生み出したもの

# ※以下５種類のオブジェクトをよく使う。
#
# 整数
# →整数とは　
１　
# とか小数点が付いていないもの。
# →整数オブジェクトという。
#
# 少数
# →少数は　
1.0　

# 小数点がついているもの。

# 文字列
# →文字列は""で囲ったもの
# ex)
 "Hello"
 
# 注）
# "1"は整数ではなく、""で囲っているため、　「文字列」である。

# 配列
# →複数のデータを1つにまとめることができる。
[1,4,1,4,1,6]
# といった具体に複数のデータを1つにまとめることが必要になることがあるため
# 覚えておく。

# ハッシュ
{name: "tanaka"}
# →Keyとvalueの組み合わせ

# 　　xe)Keyを指定して"tanaka"を取り出す
# 　　　　Keyを指定して"tanaka"を入れる
# ハッシュは色んな種類のデータをまとめて入れることができる。
# xe)

{name: "tanaka", age: 23, hobby: "soccer"}
